// 展開メモ

// 基底ベクトル
// e0^2=0, e1^2=1, e2^2=1, e3^2=1
const e0=0, e1=0, e2=0, e3=0;

// バイベクトル
//e01 = -e10
//e02 = -e20
//e03 = -e30
//e23 = -e32
//e31 = -e13
//e12 = -e21
const e01=e0*e1, e02=e0*e2, e03=e0*e3;
const e23=e2*e3, e31=e3*e1, e12=e1*e2;

// トリベクトル
//e0*e12 = -e1*e02 =e1*e20 = -e0*e21 = e2*e01
//e0*e13 = -e1*e03 =e1*e30 = -e0*e31 = e3*e01
//e0*e23 = -e2*e03 =e2*e30 = -e0*e32 = e3*e02
//e1*e23 = -e2*e13 =e2*e31 = -e1*e32 = e3*e12
const e012=e0*e1*e2, e013=e0*e1*e3, e023=e0*e2*e3, e123=e1*e2*e3;

// 疑スカラー
// I=e0123=-e1230=e2301=-e3012
const I=e01*e23;

//トリベクトル*バイベクトル
//e012*e21 = -e012*e12 = e023*e32 = -e023*e23 = e013*e31 = -e013*e13 = e0
//e012*e23 = -e012*e32 = e023*e21 = -e023*e12 = e013;
//e012*e31 = -e012*e13 = e013*e12 = -e013*e21 = e023;
//e013*e32 = -e013*e23 = e023*e13 = -e023*e31 = e012;
//e123*e32 = -e123*e23 = e1;
//e123*e13 = -e123*e31 = e2;
//e123*e21 = -e123*e12 = e3;

// 作用対象のベクトル
const v0=0, v1=0, v2=0, v3=0;
const v=v0*e0 + v1*e1 + v2*e2 + v3*e3;

// ローターの係数
const rs=0, r23=0, r31=0, r12=0;

// ローターの左作用
let Rfv = (rs + r23*e23 + r31*e31 + r12*e12)*(v0*e0 + v1*e1 + v2*e2 + v3*e3);
Rfv =      rs*v0*e0 +      rs*v1*e1 +      rs*v2*e2 +      rs*v3*e3
    + r23*e23*v0*e0 + r23*e23*v1*e1 + r23*e23*v2*e2 + r23*e23*v3*e3
	+ r31*e31*v0*e0 + r31*e31*v1*e1 + r31*e31*v2*e2 + r31*e31*v3*e3
	+ r12*e12*v0*e0 + r12*e12*v1*e1 + r12*e12*v2*e2 + r12*e12*v3*e3;
// ローター左作用の整理
Rfv =  rs*v0*e0   +  rs*v1*e1   +  rs*v2*e2   +  rs*v3*e3
    - r23*v0*e023 + r23*v1*e123 - r23*v2*e3   + r23*v3*e2
	+ r31*v0*e013 + r31*v1*e3   + r31*v2*e123 - r31*v3*e1
	- r12*v0*e012 - r12*v1*e2   + r12*v2*e1   + r12*v3*e123;
Rfv = rs*v0*e0
	+ (rs*v1 - r31*v3 + r12*v2)*e1
	+ (rs*v2 + r23*v3 - r12*v1)*e2
	+ (rs*v3 - r23*v2 + r31*v1)*e3
	+ (r23*v1 + r31*v2 + r12*v3)*e123
    - r23*v0*e023
	+ r31*v0*e013
	- r12*v0*e012;

let A0 = rs*v0;
let A1 = rs*v1 - r31*v3 + r12*v2;
let A2 = rs*v2 + r23*v3 - r12*v1;
let A3 = rs*v3 - r23*v2 + r31*v1;
let A012 = r12*v0;
let A013 = r31*v0;
let A023 = r23*v0;
let A123 = r23*v1 + r31*v2 + r12*v3;

// ローターのサンドイッチ積
let RvR1 = Rfv*(rs - r23*e23 - r31*e31 - r12*e12);
RvR1 = rs*A0*e0     - A0*e0    *r23*e23 - A0*e0    *r31*e31 - A0*e0    *r12*e12
	 + rs*A1*e1     - A1*e1    *r23*e23 - A1*e1    *r31*e31 - A1*e1    *r12*e12
	 + rs*A2*e2     - A2*e2    *r23*e23 + A2*e2    *r31*e31 + A2*e2    *r12*e12
	 + rs*A3*e3     - A3*e3    *r23*e23 + A3*e3    *r31*e31 + A3*e3    *r12*e12
	 + rs*A123*e123 - A123*e123*r23*e23 - A123*e123*r31*e31 - A123*e123*r12*e12
	 - rs*A023*e023 + A023*e023*r23*e23 + A023*e023*r31*e31 + A023*e023*r12*e12
	 + rs*A013*e013 - A013*e013*r23*e23 - A013*e013*r31*e31 - A013*e013*r12*e12
	 - rs*A012*e012 + A012*e012*r23*e23 + A012*e012*r31*e31 + A012*e012*r12*e12;
RvR1 = rs*A0*e0     - A0  *r23*e023     + A0  *r31*e013     - A0  *r12*e012
	 + rs*A1*e1     - A1  *r23*e123     + A1  *r31*e3       - A1  *r12*e2
	 + rs*A2*e2     - A2  *r23*e3       + A2  *r31*e123     - A2  *r12*e1
	 + rs*A3*e3     + A3  *r23*e2       + A3  *r31*e1       + A3  *r12*e123
	 + rs*A123*e123 + A123*r23*e1       + A123*r31*e2       + A123*r12*e3
	 - rs*A023*e023 - A023*r23*e0       - A023*r31*e012     - A023*r12*e013
	 + rs*A013*e013 - A013*r23*e012     - A013*r31*e0       + A013*r12*e023
	 - rs*A012*e012 + A012*r23*e013     + A012*r31*e023     - A012*r12*e0;
RvR1 = (rs*A0 - A023*r23 - A013*r31 - A012*r12)*e0
	 + (rs*A1 - A2*r12 + A3*r31 + A123*r23)*e1
	 + (rs*A2 - A1*r12 + A3*r23 + A123*r31)*e2
	 + (rs*A3 + A1*r31 - A2*r23 + A123*r12)*e3
	 + ( rs*A123 - A1*r23 + A2*r31 + A3*r12)*e123
	 + (-rs*A023 - A0*r23 + A013*r12 + A012*r31)*e023
	 + ( rs*A013 + A0*r31 - A023*r12 + A012*r23)*e013
	 + (-rs*A012 - A0*r12 - A023*r31 - A013*r23)*e012;

// トランスレーターの係数
const ts=0, t01=0, t02=0, t03=0;
